---
kind: property
id: P:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.SketchGalleryOptions
source: html/fe43c11b-92c3-9ca0-e17a-38185551794a.htm
---
# Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.SketchGalleryOptions Property

The sketch option provided when promt to place a family instance.

## Syntax (C#)
```csharp
public SketchGalleryOptions SketchGalleryOptions { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration